MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx564f128l.h
extern volatile __I2C3ASTATbits_t I2C3ASTATbits __asm__ ("I2C3ASTAT") __attribute__((section("sfrs"), address(0xBF805210)));
#define I2C5STAT I2C5STAT
extern volatile uint32_t   I2C5STAT __attribute__((section("sfrs"), address(0xBF805210)));
typedef union {
  struct {
    uint32_t TBF:1;
    uint32_t RBF:1;
    uint32_t R_W:1;
    uint32_t S:1;
    uint32_t P:1;
    uint32_t D_A:1;
    uint32_t I2COV:1;
    uint32_t IWCOL:1;
    uint32_t ADD10:1;
    uint32_t GCSTAT:1;
    uint32_t BCL:1;
    uint32_t :3;
    uint32_t TRSTAT:1;
    uint32_t ACKSTAT:1;
  };
  struct {
    uint32_t :6;
    uint32_t I2CPOV:1;
  };
  struct {
    uint32_t w:32;
  };
} __I2C5STATbits_t;
extern volatile __I2C5STATbits_t I2C5STATbits __asm__ ("I2C5STAT") __attribute__((section("sfrs"), address(0xBF805210)));
extern volatile uint32_t        I2C3ASTATCLR __attribute__((section("sfrs"),address(0xBF805214)));
extern volatile uint32_t        I2C5STATCLR __attribute__((section("sfrs"),address(0xBF805214)));
extern volatile uint32_t        I2C3ASTATSET __attribute__((section("sfrs"),address(0xBF805218)));
extern volatile uint32_t        I2C5STATSET __attribute__((section("sfrs"),address(0xBF805218)));
extern volatile uint32_t        I2C3ASTATINV __attribute__((section("sfrs"),address(0xBF80521C)));
extern volatile uint32_t        I2C5STATINV __attribute__((section("sfrs"),address(0xBF80521C)));
#define I2C3AADD I2C3AADD
extern volatile uint32_t   I2C3AADD __attribute__((section("sfrs"), address(0xBF805220)));
#define I2C5ADD I2C5ADD
extern volatile uint32_t   I2C5ADD __attribute__((section("sfrs"), address(0xBF805220)));
extern volatile uint32_t        I2C3AADDCLR __attribute__((section("sfrs"),address(0xBF805224)));
extern volatile uint32_t        I2C5ADDCLR __attribute__((section("sfrs"),address(0xBF805224)));
extern volatile uint32_t        I2C3AADDSET __attribute__((section("sfrs"),address(0xBF805228)));
extern volatile uint32_t        I2C5ADDSET __attribute__((section("sfrs"),address(0xBF805228)));
extern volatile uint32_t        I2C3AADDINV __attribute__((section("sfrs"),address(0xBF80522C)));
extern volatile uint32_t        I2C5ADDINV __attribute__((section("sfrs"),address(0xBF80522C)));
#define I2C3AMSK I2C3AMSK
extern volatile uint32_t   I2C3AMSK __attribute__((section("sfrs"), address(0xBF805230)));
#define I2C5MSK I2C5MSK
extern volatile uint32_t   I2C5MSK __attribute__((section("sfrs"), address(0xBF805230)));
extern volatile uint32_t        I2C3AMSKCLR __attribute__((section("sfrs"),address(0xBF805234)));
extern volatile uint32_t        I2C5MSKCLR __attribute__((section("sfrs"),address(0xBF805234)));
extern volatile uint32_t        I2C3AMSKSET __attribute__((section("sfrs"),address(0xBF805238)));
extern volatile uint32_t        I2C5MSKSET __attribute__((section("sfrs"),address(0xBF805238)));
extern volatile uint32_t        I2C3AMSKINV __attribute__((section("sfrs"),address(0xBF80523C)));
extern volatile uint32_t        I2C5MSKINV __attribute__((section("sfrs"),address(0xBF80523C)));
#define I2C3ABRG I2C3ABRG
extern volatile uint32_t   I2C3ABRG __attribute__((section("sfrs"), address(0xBF805240)));
#define I2C5BRG I2C5BRG
extern volatile uint32_t   I2C5BRG __attribute__((section("sfrs"), address(0xBF805240)));
extern volatile uint32_t        I2C3ABRGCLR __attribute__((section("sfrs"),address(0xBF805244)));
extern volatile uint32_t        I2C5BRGCLR __attribute__((section("sfrs"),address(0xBF805244)));
extern volatile uint32_t        I2C3ABRGSET __attribute__((section("sfrs"),address(0xBF805248)));
extern volatile uint32_t        I2C5BRGSET __attribute__((section("sfrs"),address(0xBF805248)));
extern volatile uint32_t        I2C3ABRGINV __attribute__((section("sfrs"),address(0xBF80524C)));
extern volatile uint32_t        I2C5BRGINV __attribute__((section("sfrs"),address(0xBF80524C)));
#define I2C3ATRN I2C3ATRN
extern volatile uint32_t   I2C3ATRN __attribute__((section("sfrs"), address(0xBF805250)));
#define I2C5TRN I2C5TRN
extern volatile uint32_t   I2C5TRN __attribute__((section("sfrs"), address(0xBF805250)));
extern volatile uint32_t        I2C3ATRNCLR __attribute__((section("sfrs"),address(0xBF805254)));
extern volatile uint32_t        I2C5TRNCLR __attribute__((section("sfrs"),address(0xBF805254)));
extern volatile uint32_t        I2C3ATRNSET __attribute__((section("sfrs"),address(0xBF805258)));
extern volatile uint32_t        I2C5TRNSET __attribute__((section("sfrs"),address(0xBF805258)));
extern volatile uint32_t        I2C3ATRNINV __attribute__((section("sfrs"),address(0xBF80525C)));
extern volatile uint32_t        I2C5TRNINV __attribute__((section("sfrs"),address(0xBF80525C)));
#define I2C3ARCV I2C3ARCV
extern volatile uint32_t   I2C3ARCV __attribute__((section("sfrs"), address(0xBF805260)));
#define I2C5RCV I2C5RCV
extern volatile uint32_t   I2C5RCV __attribute__((section("sfrs"), address(0xBF805260)));
#define I2C1CON I2C1CON
extern volatile uint32_t   I2C1CON __attribute__((section("sfrs"), address(0xBF805300)));
typedef union {
  struct {
    uint32_t SEN:1;
    uint32_t RSEN:1;
    uint32_t PEN:1;
    uint32_t RCEN:1;
    uint32_t ACKEN:1;
    uint32_t ACKDT:1;
    uint32_t STREN:1;
    uint32_t GCEN:1;
    uint32_t SMEN:1;
    uint32_t DISSLW:1;
    uint32_t A10M:1;
    uint32_t STRICT:1;
    uint32_t SCLREL:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t :11;
    uint32_t IPMIEN:1;
    uint32_t :1;
    uint32_t I2CSIDL:1;
    uint32_t :1;
    uint32_t I2CEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __I2C1CONbits_t;
extern volatile __I2C1CONbits_t I2C1CONbits __asm__ ("I2C1CON") __attribute__((section("sfrs"), address(0xBF805300)));
extern volatile uint32_t        I2C1CONCLR __attribute__((section("sfrs"),address(0xBF805304)));
extern volatile uint32_t        I2C1CONSET __attribute__((section("sfrs"),address(0xBF805308)));
extern volatile uint32_t        I2C1CONINV __attribute__((section("sfrs"),address(0xBF80530C)));
#define I2C1STAT I2C1STAT
extern volatile uint32_t   I2C1STAT __attribute__((section("sfrs"), address(0xBF805310)));
typedef union {
  struct {
    uint32_t TBF:1;
    uint32_t RBF:1;
    uint32_t R_W:1;
    uint32_t S:1;
    uint32_t P:1;
    uint32_t D_A:1;
    uint32_t I2COV:1;
    uint32_t IWCOL:1;
    uint32_t ADD10:1;
    uint32_t GCSTAT:1;
    uint32_t BCL:1;
    uint32_t :3;
    uint32_t TRSTAT:1;
    uint32_t ACKSTAT:1;
  };
  struct {
    uint32_t :6;
    uint32_t I2CPOV:1;
  };
  struct {
    uint32_t w:32;
  };
} __I2C1STATbits_t;
extern volatile __I2C1STATbits_t I2C1STATbits __asm__ ("I2C1STAT") __attribute__((section("sfrs"), address(0xBF805310)));
extern volatile uint32_t        I2C1STATCLR __attribute__((section("sfrs"),address(0xBF805314)));
extern volatile uint32_t        I2C1STATSET __attribute__((section("sfrs"),address(0xBF805318)));
extern volatile uint32_t        I2C1STATINV __attribute__((section("sfrs"),address(0xBF80531C)));
#define I2C1ADD I2C1ADD
extern volatile uint32_t   I2C1ADD __attribute__((section("sfrs"), address(0xBF805320)));
extern volatile uint32_t        I2C1ADDCLR __attribute__((section("sfrs"),address(0xBF805324)));
extern volatile uint32_t        I2C1ADDSET __attribute__((section("sfrs"),address(0xBF805328)));
extern volatile uint32_t        I2C1ADDINV __attribute__((section("sfrs"),address(0xBF80532C)));
#define I2C1MSK I2C1MSK
extern volatile uint32_t   I2C1MSK __attribute__((section("sfrs"), address(0xBF805330)));
extern volatile uint32_t        I2C1MSKCLR __attribute__((section("sfrs"),address(0xBF805334)));
extern volatile uint32_t        I2C1MSKSET __attribute__((section("sfrs"),address(0xBF805338)));
extern volatile uint32_t        I2C1MSKINV __attribute__((section("sfrs"),address(0xBF80533C)));
#define I2C1BRG I2C1BRG
extern volatile uint32_t   I2C1BRG __attribute__((section("sfrs"), address(0xBF805340)));
extern volatile uint32_t        I2C1BRGCLR __attribute__((section("sfrs"),address(0xBF805344)));
extern volatile uint32_t        I2C1BRGSET __attribute__((section("sfrs"),address(0xBF805348)));
extern volatile uint32_t        I2C1BRGINV __attribute__((section("sfrs"),address(0xBF80534C)));
#define I2C1TRN I2C1TRN
extern volatile uint32_t   I2C1TRN __attribute__((section("sfrs"), address(0xBF805350)));
extern volatile uint32_t        I2C1TRNCLR __attribute__((section("sfrs"),address(0xBF805354)));
extern volatile uint32_t        I2C1TRNSET __attribute__((section("sfrs"),address(0xBF805358)));
extern volatile uint32_t        I2C1TRNINV __attribute__((section("sfrs"),address(0xBF80535C)));
#define I2C1RCV I2C1RCV
extern volatile uint32_t   I2C1RCV __attribute__((section("sfrs"), address(0xBF805360)));
#define I2C2CON I2C2CON
extern volatile uint32_t   I2C2CON __attribute__((section("sfrs"), address(0xBF805400)));
typedef union {
  struct {
    uint32_t SEN:1;
    uint32_t RSEN:1;
    uint32_t PEN:1;
    uint32_t RCEN:1;
    uint32_t ACKEN:1;
    uint32_t ACKDT:1;
    uint32_t STREN:1;
    uint32_t GCEN:1;
    uint32_t SMEN:1;
    uint32_t DISSLW:1;
    uint32_t A10M:1;
    uint32_t STRICT:1;
    uint32_t SCLREL:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t :11;
    uint32_t IPMIEN:1;
    uint32_t :1;
    uint32_t I2CSIDL:1;
    uint32_t :1;
    uint32_t I2CEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __I2C2CONbits_t;
